# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.11-s100_1 on Fri Apr 11 18:19:49 CEST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design DigitalTop

create_clock -name "clk" -period 8.0 -waveform {0.0 4.0} [get_ports auto_chipyard_prcictrl_domain_reset_setter_clock_in_member_allClocks_uncore_clock]
create_clock -name "dbg_clk" -period 8.0 -waveform {0.0 4.0} [get_ports debug_clock]
create_clock -name "serial_clk" -period 8.0 -waveform {0.0 4.0} [get_ports serial_tl_0_clock_in]

set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports auto_chipyard_prcictrl_domain_reset_setter_clock_in_member_allClocks_uncore_reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports resetctrl_hartIsInReset_0]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports resetctrl_hartIsInReset_1]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports resetctrl_hartIsInReset_2]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports resetctrl_hartIsInReset_3]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_jtag_TCK]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_jtag_TMS]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_jtag_TDI]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_mfr_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_part_number[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_version[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_version[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_version[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {debug_systemjtag_version[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_dmactiveAck]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_aw_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_w_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_b_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_resp[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_b_bits_resp[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_ar_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_r_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_resp[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_r_bits_resp[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_r_bits_last]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports custom_boot]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_in_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_in_bits_phit[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_out_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports uart_0_rxd]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports auto_mbus_fixedClockNode_anon_out_clock]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports auto_mbus_fixedClockNode_anon_out_reset]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports auto_cbus_fixedClockNode_anon_out_clock]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports auto_cbus_fixedClockNode_anon_out_reset]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_jtag_TDO_data]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_systemjtag_jtag_TDO_driven]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_ndreset]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports debug_dmactive]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_aw_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_len[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_size[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_size[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_size[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_burst[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_burst[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_aw_bits_lock]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_cache[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_cache[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_cache[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_cache[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_prot[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_prot[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_prot[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_qos[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_qos[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_qos[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_aw_bits_qos[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_w_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_w_bits_strb[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_w_bits_last]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_b_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_ar_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_id[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_id[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_id[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_id[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_len[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_size[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_size[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_size[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_burst[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_burst[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_ar_bits_lock]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_cache[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_cache[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_cache[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_cache[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_prot[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_prot[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_prot[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_qos[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_qos[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_qos[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {mem_axi4_0_ar_bits_qos[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports mem_axi4_0_r_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_in_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_out_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports {serial_tl_0_out_bits_phit[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_debug_ser_busy]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports serial_tl_0_debug_des_busy]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports uart_0_txd]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.25 [get_ports clock_tap]
set_wire_load_mode "enclosed"
