# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.11-s100_1 on Fri Apr 04 19:44:53 CEST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design TilePRCIDomain

create_clock -name "clk" -period 4.0 -waveform {0.0 2.0} [get_ports auto_tap_clock_in_clock]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tap_clock_in_clock]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_intsink_in_sync_0]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_reset_vector_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_hartid_in]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_int_in_clock_xing_in_2_sync_0]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_int_in_clock_xing_in_1_sync_0]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_int_in_clock_xing_in_0_sync_0]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_int_in_clock_xing_in_0_sync_1]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_a_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_b_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_opcode[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_opcode[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_opcode[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_param[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_param[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_size[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_size[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_size[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_size[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_source[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_source[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_address[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_mask[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_b_bits_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_b_bits_corrupt]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_c_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_d_valid]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_opcode[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_opcode[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_opcode[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_param[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_param[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_size[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_size[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_size[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_size[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_source[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_source[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_sink[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_sink[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_sink[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_d_bits_denied]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_d_bits_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_d_bits_corrupt]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_e_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tap_clock_in_reset]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_intsink_out_2_0]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_intsink_out_1_0]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_intsink_out_0_0]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iretire]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_iaddr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_itype[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_itype[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_itype[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_group_0_itype[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_trace_core_source_out_group_0_ilastsize]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_priv[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_priv[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_priv[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_priv[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_tval[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_cause[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_core_source_out_time[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_trace_source_out_insns_0_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_iaddr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_insn[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_priv[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_priv[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_priv[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_trace_source_out_insns_0_exception]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_element_reset_domain_rockettile_trace_source_out_insns_0_interrupt]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[63]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[62]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[61]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[60]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[59]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[58]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[57]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[56]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[55]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[54]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[53]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[52]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[51]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[50]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[49]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[48]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[47]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[46]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[45]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[44]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[43]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[42]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[41]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[40]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_cause[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_insns_0_tval[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[63]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[62]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[61]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[60]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[59]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[58]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[57]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[56]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[55]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[54]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[53]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[52]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[51]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[50]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[49]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[48]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[47]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[46]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[45]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[44]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[43]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[42]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[41]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[40]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_element_reset_domain_rockettile_trace_source_out_time[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_a_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_opcode[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_opcode[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_opcode[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_param[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_param[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_param[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_size[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_size[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_size[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_size[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_source[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_source[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_address[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_mask[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_a_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_a_bits_corrupt]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_b_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_c_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_opcode[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_opcode[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_opcode[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_param[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_param[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_param[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_size[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_size[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_size[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_size[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_source[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_source[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_address[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[63]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[62]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[61]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[60]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[59]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[58]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[57]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[56]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[55]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[54]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[53]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[52]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[51]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[50]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[49]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[48]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[47]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[46]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[45]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[44]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[43]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[42]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[41]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[40]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[39]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[38]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[37]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[36]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[35]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[34]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[33]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[32]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_c_bits_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_c_bits_corrupt]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_d_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports auto_tl_master_clock_xing_out_e_valid]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_e_bits_sink[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_e_bits_sink[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports {auto_tl_master_clock_xing_out_e_bits_sink[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports clock]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.025 [get_ports reset]
set_wire_load_mode "enclosed"
